Revit 2026 API

# GroundConductorSizeSetErase Method

---

Removes a specified GroundConductorSize from the set.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual int Erase(
	GroundConductorSize item
)
```
```vb
Public Overridable Function Erase (
	item As GroundConductorSize
) As Integer
```
```cpp
public:
virtual int Erase(
	GroundConductorSize^ item
)
```
```fsharp
abstract Erase :
        item : GroundConductorSize -> int
override Erase :
        item : GroundConductorSize -> int
```

#### Parameters

item GroundConductorSize
    The GroundConductorSize to be erased.

#### Return Value

Int32The number of GroundConductorSizes that were erased from the set.

#### Reference

GroundConductorSizeSet Class

Autodesk.Revit.DB.Electrical Namespace